# ハッシュ
# ============================================
# キーと値を組み合わせてデータを管理するオブジェクト
# ハッシュのキーにはよくシンボルが使われる
# 例
# {}
# { キー1 => 値1, キー2 => 値2, キー3 => 値3 }
# ============================================

currencies = {
  'japan' => 'yen',
  'us' => 'dollar',
  'india' => 'rupee'
}

# 要素の追加
# ============================================
# イタリアの通貨を追加する
currencies['italy'] = 'euro'
puts currencies
# ============================================

# 要素の変更
# ============================================
currencies['japan'] = '円'
puts currencies
# ============================================

# 要素の削除
# ============================================
currencies.delete('japan')
puts currencies
# ============================================

# ハッシュを使った繰り返し処理
# ============================================
currencies.each do |key , value|
	puts "#{key}, #{value}"
end
# ============================================

# キーと値を両方シンボルで書くハッシュ
# ============================================
{ japan: :yen, us: :dollar, india: :rupee }
# ============================================